Enums/Renault_СостояниеЗапросаНаКоммерческуюПомощь.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>Renault_СостояниеЗапросаНаКоммерческуюПомощь</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПодготовкаДилером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросОтправлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросНаРассмотренииSRC</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВОжиданииОтветаДилера</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Одобрено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеОдобрено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыто</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/Renault_ЗапросНаКоммерческуюПомощь.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>Renault_ЗапросНаКоммерческуюПомощь</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОбращения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_ОснованияЗапросаНаКоммерческуюПомощь</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Гарантия</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пробег</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГосНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКлиента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_ТипыКлиентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_Приоритет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VIN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>17</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбращениеКлиента</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.DMS_ОбращениеКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Модели</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПервичныйИнтерес</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомплектацияАвто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыКомплектации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапросДилераСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлатныеРемонты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПродажиАвто</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеАвто</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_СостоянияАвто</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбращенияВДЦ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФункциональныйКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РепутационныеРиски</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮридическиеРиски</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпециалистРено</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БизнесРегион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_БизнесРегионы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрохождениеТО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_ПрохождениеТО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаличиеДопОборудования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПовтороноеПриобретенияАвто</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтоимостьРешенияПоГарантийнымРасценкам</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтоимостьРешенияПоКоммерческимРасценкам</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РекомендованнаяКоммерческаяПомощь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусЗапроса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_СостояниеЗапросаНаКоммерческуюПомощь</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CaseNumber</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CaseStatus</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DATE_MODIFIED</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОщущениеКлиента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_ОщущенияКлиентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроблемнаяСистемаАвто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_ПроблемныеСистемыАвто</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентСкидкиICM</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СогласованиеСТекЛайн</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПожеланиеКлиента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_ПожеланияКлиентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентРекомендованноцКоммерческойПомощи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкидкаКлиента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоментарийПричинаУвелеченияСкидки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DateResolved</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОткрытияДосье</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытияДосье</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonModules/Renault_ОбменДаннымиRForce/Ext/Module.bsl
//Механизм работы с запросом на коммерческую помощь
//Обмен данными с RFORCE
//

//Работа с ЗКП
Функция ОбновитьСтатусыЗКП(Параметр = Неопределено) Экспорт
	
	ОтветСервера="";
	
	GUID_TZ = Новый ТаблицаЗначений;
	GUID_TZ.Колонки.Добавить("GUID");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Renault_ЗапросНаКоммерческуюПомощь.Ссылка
		|ИЗ
		|	Документ.Renault_ЗапросНаКоммерческуюПомощь КАК Renault_ЗапросНаКоммерческуюПомощь
		|ГДЕ
		|	Renault_ЗапросНаКоммерческуюПомощь.Проведен = ИСТИНА";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтрокаТЗ = GUID_TZ.Добавить();
		СтрокаТЗ.GUID = Строка(ВыборкаДетальныеЗаписи.Ссылка.УникальныйИдентификатор());
	КонецЦикла;
		
	ПараметрыЗапроса = Новый Структура("GUID_TZ",GUID_TZ);
		
	ВремяНачала=ТекущаяДата();
	
	Ответ = Неопределено;
	Если DMS_DataExchange.sendMessage(DMS_ОбщиеПовторныеФункции.ПараметрыHTTPСоединения(),,"ECARE_serv.readJournalAll",DMS_DataExchange.newPackage(ПараметрыЗапроса),Ответ) Тогда
		Для каждого стр из Ответ Цикл
			ЗКПСсылка = документы.Renault_ЗапросНаКоммерческуюПомощь.ПолучитьСсылку(Новый УникальныйИдентификатор(стр.GUID));  
			ОбЗКП = ЗКПСсылка.ПолучитьОбъект();	
			ЗаполнитьЗначенияСвойств(ОбЗКП, стр,"CaseNumber,CaseStatus,DATE_MODIFIED");
			ОбновитьЗначениеСтатусаЗапроса(ОбЗКП, стр);
			ОбЗКП.Записать();
		КонецЦикла;
	КонецЕсли;
	
КонецФункции

Процедура ОбновитьЗначениеСтатусаЗапроса(ОбЗКП, ОтветСервера);
	
	CaseStatus = ОтветСервера.CaseStatus;
	DealerProactivityExpected = ОтветСервера.DealerProactivityExpected;
	
	Если CaseStatus = "New" Тогда
		ОбЗКП.СтатусЗапроса = Перечисления.Renault_СостояниеЗапросаНаКоммерческуюПомощь.ЗапросОтправлен;
	ИначеЕсли CaseStatus = "Open" Тогда
		Если не ЗначениеЗаполнено(ОбЗКП.ДатаОткрытияДосье) Тогда
			ОбЗКП.ДатаОткрытияДосье = ТекущаяДата();
		КонецЕсли;
		ОбЗКП.СтатусЗапроса = Перечисления.Renault_СостояниеЗапросаНаКоммерческуюПомощь.ЗапросНаРассмотренииSRC;
	ИначеЕсли CaseStatus = "Waiting for reply" Тогда
		ОбЗКП.СтатусЗапроса = Перечисления.Renault_СостояниеЗапросаНаКоммерческуюПомощь.ВОжиданииОтветаДилера;
	ИначеЕсли CaseStatus = "Answered" Тогда
		ОбЗКП.СтатусЗапроса = Перечисления.Renault_СостояниеЗапросаНаКоммерческуюПомощь.ЗапросНаРассмотренииSRC;
	ИначеЕсли CaseStatus = "Resolved" Тогда
		 Если ЗначениеЗаполнено(DealerProactivityExpected) Тогда
			 Если DealerProactivityExpected Тогда
				ОбЗКП.DateResolved = ТекущаяДата();
				ОбЗКП.СтатусЗапроса = Перечисления.Renault_СостояниеЗапросаНаКоммерческуюПомощь.Одобрено;
			Иначе
				ОбЗКП.СтатусЗапроса = Перечисления.Renault_СостояниеЗапросаНаКоммерческуюПомощь.НеОдобрено;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли CaseStatus = "Closed" Тогда
		Если не ЗначениеЗаполнено(ОбЗКП.ДатаЗакрытияДосье) Тогда
			ОбЗКП.ДатаЗакрытияДосье = ТекущаяДата();
		КонецЕсли;
		ОбЗКП.СтатусЗапроса = Перечисления.Renault_СостояниеЗапросаНаКоммерческуюПомощь.Закрыто;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗагрузитьСправочники (Параметр = Неопределено) Экспорт
	
	Ответ = Неопределено;
	Если DMS_DataExchange.sendMessage(DMS_ОбщиеПовторныеФункции.ПараметрыHTTPСоединения(),"Consolidation","ECARE_serv.GetDictionary",,Ответ) Тогда
		Если Ответ.Свойство ("ProblemsAfterSales") Тогда
			ЗагрузитьСправочник("DMS_ПроблемыПослеПродажногоОбслуживания", Ответ.ProblemsAfterSales);
		КонецЕсли;
		Если Ответ.Свойство ("ProblemsSales") Тогда
			ЗагрузитьСправочник("DMS_ПроблемыПродаж", Ответ.ProblemsSales);
		КонецЕсли;
		Если Ответ.Свойство ("FeelingsClients") Тогда
			ЗагрузитьСправочник("DMS_ОщущенияКлиентов", Ответ.FeelingsClients);
		КонецЕсли;
		Если Ответ.Свойство ("CustomersWishes") Тогда
			ЗагрузитьСправочник("DMS_ПожеланияКлиентов", Ответ.CustomersWishes);
		КонецЕсли;
		Если Ответ.Свойство ("ProblematicSystemsAuto") Тогда
			ЗагрузитьСправочник("DMS_ПроблемныеСистемыАвто", Ответ.ProblematicSystemsAuto);
			Если Ответ.Свойство ("DetailingQualityProblems") Тогда
				ЗагрузитьСправочник("DMS_ДетализацииПроблемКачества", Ответ.DetailingQualityProblems, "DMS_ПроблемныеСистемыАвто");
			КонецЕсли;
		КонецЕсли;
		Если Ответ.Свойство ("CharactersSalesProblems") Тогда
			ЗагрузитьСправочник("DMS_ХарактерыПроблемПродаж", Ответ.CharactersSalesProblems);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗагрузитьСправочник (НаименованиеСправочника, ТЗДанных, НаименованиеВладельца = "")
	
	Для Каждого СтрТЗ из ТЗДанных Цикл
		Если НаименованиеВладельца <> "" Тогда
			Владелец = Справочники[НаименованиеВладельца].НайтиПоРеквизиту("ЦентральныйGUID", СтрТЗ.Владелец);
			Справочник = Справочники[НаименованиеСправочника].НайтиПоРеквизиту("ЦентральныйGUID", СтрТЗ.GUID,,Владелец);
		Иначе
			Справочник = Справочники[НаименованиеСправочника].НайтиПоРеквизиту("ЦентральныйGUID", СтрТЗ.GUID);
		КонецЕсли;
		Если не ЗначениеЗаполнено(Справочник) Тогда
			Объект = Справочники[НаименованиеСправочника].СоздатьЭлемент();
			Объект.УстановитьНовыйКод ();
			Объект.ЦентральныйGUID =  СтрТЗ.GUID;
			Если НаименованиеВладельца <> "" Тогда
				Объект.Владелец = Владелец;
			КонецЕсли;
		Иначе
			Объект = Справочник.ПолучитьОбъект();
		КонецЕсли;
		Объект.Наименование = СтрТЗ.Наименование;
		Объект.ПометкаУдаления = СтрТЗ.ПометкаУдаления;
		Если ТЗДанных.Колонки.Найти("Идентификатор") <> Неопределено Тогда
			Объект.Идентификатор = СтрТЗ.Идентификатор;
		КонецЕсли;
		Объект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры
